Repository: linamat/Atomize
Catalog: lib/l10n/app_*.arb
Languages: hy

source: Settings
hy: Կարգավորումներ

source: Dark Mode
hy: Մուգ ռեժիմ

source: Light Mode
hy: Բաց ռեժիմ

source: Primary Color
hy: Հիմնական գույն

source: Language
hy: Լեզու

source: Data
hy: Տվյալներ

source: About
hy: Ծրագրի մասին

source: Reset All Data
hy: Վերակայել բոլոր տվյալները

# resetAllDataConfirmation
source: This will delete all your habits and progress. This action cannot be undone.
hy: Սա կջնջի ձեր բոլոր սովորույթները և առաջընթացը: Այս գործողությունը հնարավոր չէ հետ շրջել:

source: Cancel
hy: Չեղարկել

source: Reset
hy: Վերակայել

source: Apply
hy: Կիրառել

source: Delete
hy: Ջնջել

source: App Version
hy: Ծրագրի տարբերակ

source: Habit Tracker
hy: Սովորույթների հետևորդ

source: Archived Habits
hy: Արխիվացված սովորույթներ

# goal
source: Goal: {days} days
hy: Նպատակ՝ {days} օր

source: Edit
hy: Խմբագրել

source: Archive
hy: Արխիվացնել

source: Unarchive
hy: Արխիվից հանել

source: Delete habit?
hy: Ջնջել սովորույթը?

# deleteHabitConfirmation
source: This action cannot be undone.
hy: Այս գործողությունը հնարավոր չէ հետ շրջել:

source: Habit deleted
hy: Սովորույթը ջնջված է

source: Habit archived
hy: Սովորույթը արխիվացված է

# habitUnarchived
source: {name} unarchived
hy: {name} արխիվից հանված է

source: All data cleared
hy: Բոլոր տվյալները մաքրված են

source: No archived habits
hy: Արխիվացված սովորույթներ չկան

# archiveDescription
source: Archive old habits to review them later
hy: Արխիվացրեք հին սովորույթները՝ դրանք ավելի ուշ դիտելու համար

source: Undo
hy: Հետ շրջել

source: New Habit
hy: Նոր սովորույթ

source: Edit Habit
hy: Խմբագրել սովորույթը

source: Habit Name
hy: Սովորույթի անվանում

# habitDescription
source: Description (optional)
hy: Նկարագրություն (ըստ ցանկության)

# habitGoal
source: Goal (days)
hy: Նպատակ (օրեր)

source: Save
hy: Պահպանել

# nameRequired
source: Name is required
hy: Անվանումը պարտադիր է

# goalRequired
source: Goal is required
hy: Նպատակը պարտադիր է

# goalMustBePositive
source: Goal must be greater than 0
hy: Նպատակը պետք է լինի 0-ից մեծ

source: Habit created
hy: Սովորույթը ստեղծված է

source: Habit updated
hy: Սովորույթը թարմացված է

source: Select Day State
hy: Ընտրեք օրվա վիճակը

# dayStateNone
source: None
hy: Չկա

# dayStateDone
source: Done
hy: Կատարված

# dayStateFailed
source: Failed
hy: Չկատարված

# dayStateSkipped
source: Skipped
hy: Բաց թողնված

source: No Habits Yet
hy: Դեռ սովորություններ չկան

# createFirstHabit
source: Tap the + button to create your first habit
hy: Սեղմեք + կոճակը՝ ձեր առաջին սովորությունը ստեղծելու համար
